//
//  main.c
//  矩阵对角线和
//
//  Created by Jacky on 2020/3/15.
//  Copyright © 2020 Jacky. All rights reserved.
//

/*
 题目描述
 设A为n阶矩阵，即含n行n列个数值。一个n阶矩阵的主对角线为所有第k行第k列元素的全体，k=1, 2, 3… n，即从左上到右下的一条斜线，与之相对应的从右上到左下的一条斜线称为次对角线。
 输入n阶矩阵，求主对角线和次对角线元素之和。例如：下列3阶矩阵A的主对角线和为1+5+9=15，次对角线和为3+5+7 = 15，主对角线和次对角线元素之和为1+5+9+3+7 = 25。
 | 1 2 3 |
 | 4 5 6 |
 | 7 8 9 |
 输入
 测试次数T
 每组测试数据格式如下：
 输入矩阵维度n（假设n>0)
 输入n行n列数据
 输出
 对每组测试数据
 输出主对角线和次对角线上的元素和
 样例输入
 2
 2
 11 22
 33 44
 3
 111 222 333
 444 555 666
 777 888 999
 样例输出
 110
 2775
 */

#include <stdio.h>

int main() {
    int t, n, input[100][100], ans, b, c;
    scanf("%d", &t);

    for (int i = 0; i < t; i++) {
        scanf("%d", &n);
        ans = 0;
        b = n - 1;
        for (int a = 0; a < n; a++) {
            for (int k = 0; k < n; k++) {
                scanf("%d", &input[a][k]);
            }
            // 主对角线
            ans += input[a][a];
            // 次对角线
            ans += input[a][b--];
            // 判断主次对角线的中点
        }
        // 有中点
        if (n % 2) {
            c = n / 2;
            ans -= input[c][c];
        }
        printf("%d\n", ans);
    }

    return 0;
}